<template>
  <div class="xieyi">
    <div class="mu-appbar mu-paper-1" v-if="!hideTitle">
      <div @click="back" class="left"><i class="icon iconfont icon-back"></i></div>
      <div class="mu-appbar-title"><span>用户协议</span></div>
      <div class="right"></div>
    </div>
    <div class="xieyi-content">
      欢迎您访问杭州盈透网络信息技术有限公司旗下网站！注册前请仔细阅读以下协议内容：<br>
      本用户注册协议（以下简称“本协议”）是由用户（“您”）与杭州盈透网络信息技术有限公司就本网站提供的服务所订立的相关权利和义务的规范，本服务条款对您和淘海房均具有法律约束力。本网站发布的相关政策、规定构成本协议的一部分，您须同时遵守。<br>
      1、用户管理<br>
      用户单独承担发布内容的责任。用户对服务的使用是根据所有适用于淘海房房产网的国家法律、地方法律和国际法律标准的。<br>
      用户必须遵循：<br>
      (1) 从中国境内向外传输技术性资料时必须符合中国有关法规；<br>
      (2) 使用网络服务不作非法用途；　<br>
      (3) 遵守所有使用网络服务的网络协议、规定、程序和惯例。<br>
      (4) 用户的密码和帐号遭到未授权的使用或发生其他任何安全问题，用户可以立即通知淘海房，并且用户在每次连线结束，应结束帐号使用，否则用户可能得不到淘海房的安全保护。<br>
      (5) 禁止用户从事以下行为：<br>
      1) 上载、张贴、发送或传送任何非法、反动、淫秽、粗俗、猥亵的，胁迫、骚扰、中伤他人、诽谤、侵害他人隐私或诋毁他人名誉或商誉的，种族歧视、危害未成年人或其他不适当的信息或电子邮件，包括但不限于资讯、资料、文字、软件、音乐、照片、图形、信息或其他资料（以下简称内容）。<br>
      2) 未经淘海房许可的广告行为。<br>
      3) 冒充任何人或机构，或以虚伪不实的方式谎称或使人误认为与任何人或任何机构有关。<br>
      4) 伪造标题或以其他方式操控识别资料，使人误认为该内容为淘海房房产网所传送。<br>
      5) 上载、张贴、发送电子邮件或以其它方式传送无权传送的内容（例如内部资料、机密资料）。<br>
      6) 上载、张贴、发送电子邮件或以其它方式传送侵犯任何人的专利、商标、著作权、商业秘密或其他专属权利之内容。<br>
      7) 在淘海房提供的专供张贴广告的区域之外，上载、张贴、发送电子邮件或以其他方式传送广告函件、促销资料、垃圾邮件等。<br>
      8) 上载、张贴、发送电子邮件或以其他方式传送有关干扰、破坏或限制任何计算机软件、硬件或通讯设备功能的软件病毒或其他计算机代码、档案和程序之资料。<br>
      9) 干扰或破坏本服务或与本服务相连的服务器和网络，或不遵守本服务协议之规定。<br>
      10) 故意或非故意违反任何相关的中国法律、法规、规章、条例等其他具有法律效力的规范。<br>
      11) 跟踪或以其他方式骚扰他人。　　<br>
      12) 其它被淘海房视为不适当的行为。　<br>
      另外，用户对经由本服务上载、张贴、发送电子邮件或传送的内容负全部责任；对于经由本服务而传送的内容，淘海房不保证前述内容的正确性、完整性或品质。用户在接受本服务时，有可能会接触到令人不快、不适当或令人厌恶的内容。<
      在任何情况下，淘海房均不对任何内容负责，包括但不限于任何内容发生任何错误或纰漏以及衍生的任何损失或损害。
      淘海房有权（但无义务）自行拒绝或删除经由本服务提供的任何内容。用户使用上述内容，应自行承担风险。<br>
      淘海房有权利在下述情况下，对内容进行保存或披露：<br>
      (1) 法律程序所规定；<br>
      (2) 本服务条款规定；<br>
      (3) 被侵害的第三人提出权利主张；<br>
      (4) 为保护淘海房、其使用者及社会公众的权利、财产或人身安全；<br>
      (5) 其他淘海房认为有必要的情况。<br>
      2、免责声明<br>
      淘海房对于本服务包含的或用户经由或从任何与本服务有关的途径所获得的任何内容、信息或广告，不声明或保证其正确性或可靠性；并且对于用户经本服务上的广告、展示而购买、取得的任何产品、信息或资料，淘海房不负保证责任。用户自行承担使用本服务的风险。<br>
      (1) 淘海房有权但无义务，改善或更正本服务任何部分之任何疏漏、错误。<br>
      (2) 淘海房不保证以下事项（包括但不限于）：<br>
      1) 本服务适合用户的使用要求；<br>
      2) 本服务不受干扰，及时、安全、可靠或不出现错误；　<br>
      3) 用户经由本服务取得的任何产品、服务或其他材料符合用户的期望；<br>
      4) 用户使用经由本服务下载的或取得的任何资料，其风险自行负担；因该使用而导致用户电脑系统损坏或资料流失，用户应负完全责任；<br>
      5) 对基于以下原因而造成的利润、商业信誉、资料的损失或其他有形或无形损失，淘海房不承担任何直接、间接、附带、衍生或惩罚性的赔偿；<br>
      6) 服务使用或无法使用；<br>
      7) 经由本服务购买或取得的任何产品、资料或服务；<br>
      8) 用户资料遭到未授权的使用或修改；<br>
      9) 其他与本服务相关的事宜。<br>
      (3) 用户在浏览网际网路时自行判断使用淘海房的检索目录。该检索目录可能会引导用户进入到被认为具有攻击性或不适当的网站，淘海房没有义务查看检索目录所列网站的内容，因此，对其正确性、合法性、正当性不负任何责任。<br>
      (4) 用户同意，对于淘海房向用户提供的下列产品或者服务的质量缺陷本身及其引发的任何损失，淘海房无需承担任何责任：<br>
      1) 淘海房向用户免费提供的各项网络服务；<br>
      2) 淘海房向用户赠送的任何产品或者服务；<br>
      3) 淘海房向收费网络服务用户附赠的各种产品或者服务。<br>

    </div>
  </div>
</template>
<style lang="less" type="text/less" rel="stylesheet/less">
  @import "../../assets/css/mix";
  .xieyi{
    .mu-appbar{
      background-color: #fff;
      color:#4a4a4a;
      height:44/@base;
      box-shadow: none;
      border-bottom:1px solid #ececec;
      div.mu-appbar-title{
        span{
          font-size: 17/@base;
          margin-right:17/@base;
        }
      }
    }
    div.xieyi-content{
      padding:15/@base;
      background-color: #fff;
    }
  }
</style>
<script>
  export default{
      data(){
        return{
          isApp:false,
          hideTitle:false
        }
      },
      methods:{
          back(){
              this.$router.back()
          }
      },
    mounted(){
          let self = this;
      document.title=this.$route.name;
      //获取APP标识
      self.isApp = self.$route.query.isApp?self.$route.query.isApp:false;
      self.hideTitle = self.$route.query.hideTitle?self.$route.query.hideTitle:false;
    },
  }
</script>
